Revit 2027 API
CategoryNameMap.Insert Method
Insert the specified category with the specified name into the map.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Insert(
	string key,
	Category item
)
Public Overridable Function Insert (
	key As String,
	item As Category
) As Boolean
public:
virtual bool Insert(
	String^ key,
	Category^ item
)
abstract Insert :
        key : string *
        item : Category -> bool
override Insert :
        key : string *
        item : Category -> bool
Parameters
key String
The name to be used for inserting the category into the map.
item Category
The category to be inserted into the map.
Return Value
Boolean
Returns whether the category was inserted into the map.
See Also
Reference
CategoryNameMap Class
Autodesk.Revit.DB Namespace